from flask import Flask, render_template

app = Flask(__name__)

@app.route('/')
def home():
    formulas = [
        ('Кинематика', 'Путь при равномерном движении', ['static/images/f1.jpg']),
        ('Кинематика', 'Средняя скорость', ['static/images/f2.jpg']),
        ('Кинематика', 'Ускорение при равноускоренном движении', ['static/images/f3.jpg']),
        ('Кинематика', 'Зависимость скорости от времени', ['static/images/f4.jpg']),
        ('Кинематика', 'Перемещение при равноускоренном движении', ['static/images/f5(1).jpg', 'static/images/f5(2).jpg', 'static/images/f5(3).jpg']),
        ('Кинематика', 'Максимальная высота при вертикальном броске', ['static/images/f6(1).jpg', 'static/images/f6(2).jpg', 'static/images/f6(3).jpg']),
        ('Кинематика', 'Время подъема', ['static/images/f7.jpg']),
        ('Кинематика', 'Полное время полета', ['static/images/f8.jpg']),
        ('Динамика', 'Второй закон Ньютона', ['static/images/f9.jpg']),
        ('Динамика', 'Третий закон Ньютона', ['static/images/f10.jpg']),
        ('Динамика', 'Сила упругости', ['static/images/f11.jpg']),
        ('Динамика', 'Закон всемирного тяготения', ['static/images/f12.jpg']),
        ('Динамика', 'Первая космическая скорость', ['static/images/f13.jpg']),
        ('Статика', 'Момент силы определяется с помощью следующей формулы', ['static/images/f14.jpg']),
        ('Статика', 'Условие при котором тело не будет вращаться', ['static/images/f15.jpg']),
        ('Гидростатика', 'Определение давления задаётся следующей формулой', ['static/images/f16.jpg']),
        ('Гидростатика', 'Давление, которое создает столб жидкости находится по формуле', ['static/images/f17.jpg']),
        ('Гидростатика', 'Идеальный гидравлический пресс', ['static/images/f18.jpg']),
        ('Гидростатика', 'Любой гидравлический пресс', ['static/images/f19.jpg']),
        ('Гидростатика', 'Сила Архимеда', ['static/images/f20.jpg']),
        ('Импульс', 'Импульс тела', ['static/images/f21.jpg']),
        ('Импульс', 'Изменение импульса тела или системы тел', ['static/images/f22.jpg']),
        ('Импульс', 'Второй закон Ньютона в импульсной форме', ['static/images/f23.jpg']),
        ('Импульс', 'Закон сохранения импульса', ['static/images/f24.jpg']),
        ('Работа, мощность, энергия', 'Работа', ['static/images/f25.jpg']),
        ('Работа, мощность, энергия', 'Мощность', ['static/images/f26.jpg']),
        ('Работа, мощность, энергия', 'Кинетическая энергия', ['static/images/f27.jpg']),
        ('Работа, мощность, энергия', 'Потенциальная энергия', ['static/images/f28.jpg']),
        ('Работа, мощность, энергия', 'Коэффициент полезного действия', ['static/images/f29.jpg']),
        ('Термодинамика', 'Первый закон термодинамики', ['static/images/f30.jpg']),
        ('Термодинамика', 'Количество теплоты', ['static/images/f31.jpg']),
        ('Термодинамика', 'Работа идеального газа', ['static/images/f32.jpg']),
        ('Электростатика', 'Закон Кулона', ['static/images/f33.jpg']),
        ('Электростатика', 'Напряженность электрического поля', ['static/images/f34.jpg']),
        ('Электростатика', 'Электрическое напряжение', ['static/images/f35.jpg']),
        ('Электрический ток', 'Закон Ома', ['static/images/f36.jpg']),
        ('Электрический ток', 'Работа электрического тока', ['static/images/f37.jpg']),
        ('Электрический ток', 'Сила тока', ['static/images/f38.jpg']),
        ('Магнетизм', 'Сила Ампера', ['static/images/f39.jpg']),
        ('Магнетизм', 'ЭДС индукции', ['static/images/f40.jpg']),
        ('Магнетизм', 'Сила Лоренца', ['static/images/f41.jpg']),
        ('Оптика', 'Закон преломления', ['static/images/f42.jpg']),
        ('Оптика', 'Формула тонкой линзы', ['static/images/f43.jpg']),
        ('Оптика', 'Оптическая длина', ['static/images/f44.jpg']),
        ('Атомная и ядерная физика', 'Энергия кванта', ['static/images/f45.jpg']),
        ('Атомная и ядерная физика', 'Закон радиоактивного распада', ['static/images/f46.jpg']),
        ('Атомная и ядерная физика', 'Второй постулат Бора или правило частот', ['static/images/f47.jpg']),
        ('Основы специальной теории относительности', 'Релятивистская масса', ['static/images/f48.jpg']),
        ('Основы специальной теории относительности', 'Полная энергия', ['static/images/f49.jpg']),
        ('Основы специальной теории относительности', 'Энергия покоя тела', ['static/images/f50.jpg']),
    ]
    return render_template('formulas.html', formulas=formulas)

if __name__ == '__main__':
    app.run(debug=True)